После полета Юрия Гагарина в 1961 практически каждый мальчик СССР хотел стать космонавтом. Прошло уже более полувека, но профессия космонавт все так же престижна. К сожалению, не каждый желающий может пройти отбор, существуют высокие требования к уровню подготовки будущих космонавтов, а также ограничения по антропометрическим показателям. Например, рост космонавта не может быть больше 190 см и меньше 150 см.

Напишите программу, которая считывает рост претендентов в отряд космонавтов до тех пор, пока не будет введен «!». А затем выводит на первой строчке количество подходящих кандидатур, а на второй строке – минимальный и максимальный рост участников, отобранных в новый отряд космонавтов.

Гарантируется, что в отряд отберутся как минимум два летчика-космонавта.

Формат ввода
Несколько строк с ростом космонавтов и последняя строка «!».

Формат вывода
Две строки: количество кандидатур на первой, и минимальный и максимальный рост через пробел – на второй.

Пример
Ввод	Вывод
192
189
145
162
172
!
_______________________________________________________________________________________________________________________________________________________________________________
a = input()
k = 0
mi = 191
ma = 149
while a != "!":
    a = int(a)
    if 150 <= a <= 190:
        k += 1
        if a < mi:
            mi = a
        if a > ma:
            ma = a
    a = input()
print(k)
print(mi, ma)
