Игра ним для двух игроков с одной кучей и ограничением на количество забираемых камней: за один ход можно взять не больше трёх камней.
Напишите программу с «искусственным интеллектом» (ИИ), которая играет против пользователя и выигрывает, если может. Исходное количество камней в куче задаёт пользователь, программа всегда ходит первой. После каждого хода пользователя и программы необходимо сообщать, сколько камней взято и сколько осталось. В конце необходимо сообщить, кто выиграл.
Пользователь в свой ход вводит количество камней до тех пор, пока не введёт разрешённое число — от одного до трёх (или меньше — если камней осталось меньше).
При вводе некорректного значения необходимо вывести фразу: Некорректный ход: <кол-во камней> и заново потребовать вводить данные.
После хода игрока или ИИ необходимо вывести два числа: сколько камней было взято и сколько камней осталось в куче.
Если выигрывает игрок, то надо вывести фразу: Вы выиграли!, а если ИИ - фразу: ИИ выиграл!
Все сообщения программы должны строго соответствовать условию.

Формат ввода
Для старта игры вводится натуральное число.
Пример диалога игры:

9  
1 8  
4  
Некорректный ход: 4  
3  
3 5  
1 4  
4  
Некорректный ход: 4  
-1  
Некорректный ход: -1  
2  
2 2  
2 0  
ИИ выиграл!
____________________________________________________________________________________________________
n = int(input())
while n > 0:
    if n % 4 == 0:
        b = 1
    else:
        b = n % 4
    n -= b
    print(b, n)
    if n == 0:
        print('ИИ выиграл!')
    else:
        c = int(input())
        while not(1 <= c <= 3 and c <= n):
            print('Некорректный ход:', c)
            c = int(input())
        n -= c
        print(c, n)
        if n == 0:
            print('Вы выиграли!')