Последовательность чисел Фибоначчи описывает размножение кроликов, рост веток на деревьях и много чего ещё. Определяется последовательность так: первый и второй члены последовательности равны 1, а каждый последующий — сумме двух предыдущих. Напишите программу, которая выводит первые несколько членов последовательности Фибоначчи — все, не превышающие натурального числа, заданного пользователем.

Формат ввода
Одно натуральное число.

Формат вывода
Числа Фибоначчи, не превышающие введенного числа, записанные по одному в строке.

Пример
Ввод	Вывод
10
1
1
2
3
5
8
_______________________________________________________________________________________________________
n = int(input()) 
(x, y) = (1, 1) 
while x <= n: 
    print(x) 
    (x, y) = (y, x + y)